# Pandas DataFrame item keys

In [1]:
import pandas as pd

In [2]:
data = pd.DataFrame({"Student Name":["Archana","Mani","Kalpana","Thiru"],"Age":[23,25,28,21]})

In [3]:
data

  Student Name  Age
0      Archana   23
1         Mani   25
2      Kalpana   28
3        Thiru   21

In [4]:
data.columns

Index(['Student Name', 'Age'], dtype='object')

In [5]:
data.__iter__()

In [6]:
for i in data.__iter__():
    print(i)

Student Name
Age

In [7]:
data.items()

In [8]:
for i in data.items():
    print(i)

('Student Name', 0    Archana
1       Mani
2    Kalpana
3      Thiru
Name: Student Name, dtype: object)
('Age', 0    23
1    25
2    28
3    21
Name: Age, dtype: int64)

In [9]:
# Here tuple is created

In [10]:
data.items?

Signature: data.items() -> 'Iterable[tuple[Hashable, Series]]'
Docstring:
Iterate over (column name, Series) pairs.

Iterates over the DataFrame columns, returning a tuple with
the column name and the content as a Series.

Yields
------
label : object
    The column names for the DataFrame being iterated over.
content : Series
    The column entries belonging to each label, as a Series.

See Also
--------
DataFrame.iterrows : Iterate over DataFrame rows as
    (index, Series) pairs.
DataFrame.itertuples : Iterate over DataFrame rows as namedtuples
    of the values.

Examples
--------
>>> df = pd.DataFrame({'species': ['bear', 'bear', 'marsupial'],
...                   'population': [1864, 22000, 80000]},
...                   index=['panda', 'polar', 'koala'])
>>> df
        species   population
panda   bear      1864
polar   bear      22000
koala   marsupial 80000
>>> for label, content in df.items():
...     print(f'label: {label}')
...     print(f'content: {content}', sep='\n')
...
label: species
content:
panda         bear
polar         bear
koala    marsupial
Name: species, dtype: object
label: population
content:
panda     1864
polar    22000
koala    80000
Name: population, dtype: int64
File:      ~/opt/anaconda3/lib/python3.9/site-packages/pandas/core/frame.py
Type:      method

In [13]:
data

  Student Name  Age
0      Archana   23
1         Mani   25
2      Kalpana   28
3        Thiru   21

In [12]:
for i,j in data.items():
    print(f"label:{i}")
    print(f"content{j}",sep="\n")

label:Student Name
content0    Archana
1       Mani
2    Kalpana
3      Thiru
Name: Student Name, dtype: object
label:Age
content0    23
1    25
2    28
3    21
Name: Age, dtype: int64

In [14]:
# Label is Age
# Content is Name

In [15]:
# items always iterate over the entire data

In [16]:
data = pd.read_csv("/Users/archanaqueen/Desktop/i18n/Daily Class/Pandas/Dataset_work/All-CSV-ML-Data-Files-Download-master/chicago.csv")

In [17]:
data

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00
...,...,...,...,...
32058,"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,$87384.00
32059,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,$84450.00
32060,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$87384.00
32061,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$113664.00
32062,NaN,NaN,NaN,NaN

In [18]:
data.items()

In [19]:
for i in data.items():
    print(i)

('Name', 0            AARON,  ELVIA J
1          AARON,  JEFFERY M
2             AARON,  KARINA
3        AARON,  KIMBERLEI R
4        ABAD JR,  VICENTE M
                ...
32058     ZYGOWICZ,  PETER J
32059      ZYMANTAS,  MARK E
32060    ZYRKOWSKI,  CARLO E
32061    ZYSKOWSKI,  DARIUSZ
32062                    NaN
Name: Name, Length: 32063, dtype: object)
('Position Title', 0                WATER RATE TAKER
1                  POLICE OFFICER
2                  POLICE OFFICER
3        CHIEF CONTRACT EXPEDITER
4               CIVIL ENGINEER IV
                   ...
32058              POLICE OFFICER
32059              POLICE OFFICER
32060              POLICE OFFICER
32061     CHIEF DATA BASE ANALYST
32062                         NaN
Name: Position Title, Length: 32063, dtype: object)
('Department', 0             WATER MGMNT
1                  POLICE
2                  POLICE
3        GENERAL SERVICES
4             WATER MGMNT
               ...
32058              POLICE
32059              POLICE
32060              POLICE
32061                DoIT
32062                 NaN
Name: Department, Length: 32063, dtype: object)
('Employee Annual Salary', 0         $90744.00
1         $84450.00
2         $84450.00
3         $89880.00
4        $106836.00
            ...
32058     $87384.00
32059     $84450.00
32060     $87384.00
32061    $113664.00
32062           NaN
Name: Employee Annual Salary, Length: 32063, dtype: object)

In [20]:
# All columns are created as a tuple

In [22]:
for i,j in data.items():
    print(i)
    print(j,sep = "\n")

Name
0            AARON,  ELVIA J
1          AARON,  JEFFERY M
2             AARON,  KARINA
3        AARON,  KIMBERLEI R
4        ABAD JR,  VICENTE M
                ...
32058     ZYGOWICZ,  PETER J
32059      ZYMANTAS,  MARK E
32060    ZYRKOWSKI,  CARLO E
32061    ZYSKOWSKI,  DARIUSZ
32062                    NaN
Name: Name, Length: 32063, dtype: object
Position Title
0                WATER RATE TAKER
1                  POLICE OFFICER
2                  POLICE OFFICER
3        CHIEF CONTRACT EXPEDITER
4               CIVIL ENGINEER IV
                   ...
32058              POLICE OFFICER
32059              POLICE OFFICER
32060              POLICE OFFICER
32061     CHIEF DATA BASE ANALYST
32062                         NaN
Name: Position Title, Length: 32063, dtype: object
Department
0             WATER MGMNT
1                  POLICE
2                  POLICE
3        GENERAL SERVICES
4             WATER MGMNT
               ...
32058              POLICE
32059              POLICE
32060              POLICE
32061                DoIT
32062                 NaN
Name: Department, Length: 32063, dtype: object
Employee Annual Salary
0         $90744.00
1         $84450.00
2         $84450.00
3         $89880.00
4        $106836.00
            ...
32058     $87384.00
32059     $84450.00
32060     $87384.00
32061    $113664.00
32062           NaN
Name: Employee Annual Salary, Length: 32063, dtype: object

In [23]:
data.keys()

Index(['Name', 'Position Title', 'Department', 'Employee Annual Salary'], dtype='object')

In [24]:
for i in data.keys():
    print(i)

Name
Position Title
Department
Employee Annual Salary

In [25]:
# It gives names of the columns